# IsMonitoringLinkElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..IsMonitoringLinkElement Method
Element Class See Also
---
Indicate whether an element is monitoring any elements in any linked models.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsMonitoringLinkElement()
```

Visual Basic
---
```text
Public Function IsMonitoringLinkElement As Boolean
```

Visual C++
---
```text
public:
bool IsMonitoringLinkElement()
```

# ### Return Value
True if this element is monitoring elements in a linked models. Otherwise, false will be returned.
# See Also
Element Class
Autodesk.Revit.DB Namespace